code/openfoam/tutorials/compressibleVoF/depthCharge2D/constant/physicalProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       NSRDS;
    thermo          NSRDS;
    equationOfState NSRDS;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    ${${FOAM_ETC}/thermoData/NSRDSphysicalProperties!H2O}
}

// ************************************************************************* //
